# Exploratory Notebook

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('../Data/im.db')

In [4]:
pd.read_sql("""

SELECT *
FROM movie_basics







""", conn)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [5]:
pd.read_sql("""

SELECT *
FROM movie_ratings







""", conn)

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [6]:
pd.read_sql("""

SELECT *
FROM movie_akas







""", conn)

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [31]:
pd.read_sql("""

SELECT primary_title, averagerating, numvotes
FROM movie_basics 
JOIN movie_ratings
   USING(movie_id)
GROUP BY numvotes
ORDER BY averagerating DESC
LIMIT 25




""", conn)

                                        primary_title  averagerating  numvotes
0                   Once Upon a Time ... in Hollywood            9.7      5600
1                                 Ekvtime: Man of God            9.6      2604
2                                       Aloko Udapadi            9.5      6509
3                                             Peranbu            9.4      9629
4                                     The Mountain II            9.3    100568
5                                            Aynabaji            9.3     18470
6                                              Wheels            9.3     17308
7                                      Adutha Chodyam            9.3       587
8                           The Last Pogo Jumps Again            9.3        42
9                              CM101MMXI Fundamentals            9.2     41560
10                                          Natsamrat            9.2      4297
11                                    On vam ne Dimon            9.2      2721
12                                           Dominion            9.2      1096
13                                            Sweater            9.2        79
14                                  A Man Called Ahok            9.1      4162
15                                        The Unnamed            9.1      2973
16                                  Pariyerum Perumal            9.0      4854
17                                          Yowis Ben            9.0      2992
18                              O.J.: Made in America            8.9     14946
19                                    A Billion Lives            8.9      2715
20                                        Tell No One            8.9      2111
21                      Godhi Banna Sadharana Mykattu            8.9      2001
22  Bruce Springsteen and the E Street Band: Londo...            8.9       241
23                  Caravaggio and My Mother the Pope            8.9        51
24                                          Inception            8.8   1841066